app/views/static_pages/home.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
<% @gossips.each do |x| %>
<p> Name: <%= x.user.first_name %><br>