app/views/gossips/show.html.erb

<p> Name: <a href="/users/<%= @gossip.user.id %>"><%= @gossip.user.first_name %></a></p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]