app/controllers/gossips_controller.rb

INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test"], ["content", "blabla"], ["user_id", 4], ["created_at", "2022-11-01 17:09:29.414789"], ["updated_at", "2022-11-01 17:09:29.414789"]]
---
    def create
        @gossips = Gossip.new(title: params[:title], content: params[:content], user_id: rand(1..10))
        if @gossips.save # essaie de sauvegarder en base gossip