app/controllers/static_pages_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def home
    @gossips = Gossip.all

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def gossip
    @gossip = Gossip.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def user
    @user = User.find(params[:id])
    @city = City.find(@user.city_id)